Catalogs/ITC_Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>ITC_Задача</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>JIRA</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_JIRA</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JIRA_CODE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JIRA_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктирования</Name>
					<Comment>customfield_10415</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Comment>resolutiondate</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальнаяОценка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Релиз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Релиз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спринт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Спринт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сущность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тестировщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_ТипЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эпик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/Время.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>Время</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Факт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Задача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/ITC_СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>ITC_СтатусыЗадач</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>JIRA</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_JIRA</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JIRA_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_КатегорияСтатуса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ITC_РезультатВыполненияЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ITC_СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ITC_Задача/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьВремя();
	
	Если Не ЗначениеЗаполнено(Объект.JIRA_ID) Тогда
		Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
			Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.Статус) Тогда
			Объект.Статус = Справочники.ITC_СтатусыЗадач.Новая;
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьВидПоляJIRA();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВидПоляJIRA()
	
	яЕстьИД = ЗначениеЗаполнено(Объект.JIRA_ID);
	
	Если яЕстьИД Тогда
		Элементы.JIRA_ID.ТолькоПросмотр = Истина;
		Элементы.JIRA_ID.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.JIRA_ID.Гиперссылка = Истина;
		ЗаполнитьВидПоляJIRA_Сервер(яЕстьИД);
		
		Элементы.Проект.ТолькоПросмотр = яЕстьИД;
		
		Элементы.Аналитик.ТолькоПросмотр = яЕстьИД;
		Элементы.Разработчик.ТолькоПросмотр = яЕстьИД;
		Элементы.Тестировщик.ТолькоПросмотр = яЕстьИД;
		Элементы.Куратор.ТолькоПросмотр = яЕстьИД;
		
		Элементы.Релиз.ТолькоПросмотр = яЕстьИД;
		Элементы.Спринт.ТолькоПросмотр = яЕстьИД;
		Элементы.Эпик.ТолькоПросмотр = яЕстьИД;
		
		Элементы.Описание.ТолькоПросмотр = яЕстьИД;
	КонецЕсли;
	
	Элементы.Клиент.Видимость = Не яЕстьИД;
	Элементы.КонтактноеЛицо.Видимость = Не яЕстьИД;
	
	Элементы.ФормаОбновитьЗадачу.Видимость = яЕстьИД;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидПоляJIRA_Сервер(яЕстьИД)
	Если яЕстьИД Тогда
		Элементы.JIRA_ID.УстановитьДействие("Нажатие", "JIRA_IDНажатие"); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьВремя()

	яЗ = Новый Запрос;
	яЗ.УстановитьПараметр("Задача", Объект.Ссылка);
	яЗ.Текст = 
	"ВЫБРАТЬ
	|	ВремяОбороты.ФактОборот КАК Затрачено
	|ИЗ
	|	РегистрНакопления.Время.Обороты(, , Период, Задача = &Задача) КАК ВремяОбороты";
	
	яРезЗап = яЗ.Выполнить();
	яВ = яРезЗап.Выбрать();
	Если яВ.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, яВ);
		//Теперь остаток берём только из JIRA		
		//ЭтаФорма.Осталось = Макс(0, Объект.ПервоначальнаяОценка - ЭтаФорма.Затрачено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьТаймер(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ITC_ТаймерКлиент.ЗапуститьТаймер(Объект.Ссылка, ЭтаФорма);
	Иначе
		Сообщить("Задача не была сохранена, необходимо сначала сохранить.");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОстановитьТаймерНаСервере(пСсылка)
	Обработки.ITC_Таймер.ОстановитьТаймер(пСсылка);
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьТаймер(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОстановитьТаймерНаСервере(Объект.Ссылка);
	Иначе
		Сообщить("Задача не была сохранена, необходимо сначала сохранить.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура JIRA_IDПриИзменении(Элемент)
	ЗаполнитьВидПоляJIRA();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗадачуИзJIRA_Сервер()
	ITC_JIRA.ОбновитьЗадачу(Объект,, Ложь);
	Модифицированность = Истина;
	ОбновитьВремя();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗадачуИзJIRA(Команда)
	Если ЗначениеЗаполнено(Объект.JIRA) Тогда
		ОбновитьЗадачуИзJIRA_Сервер();
	Иначе
		яС = Новый СообщениеПользователю;
		яС.Поле = "JIRA";
		яС.ПутьКДанным = "Объект";
		яС.Текст = "Не заполнен сервер JIRA";
		яС.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура JIRA_IDНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	яПодключение = JIRA_IDНажатие_Сервер();
	ЗапуститьПриложение(яПодключение.Схема + "://" + яПодключение.Сервер + "/browse/" + Объект.JIRA_ID);
КонецПроцедуры

&НаСервере
Функция JIRA_IDНажатие_Сервер()
	Возврат ITC_JIRA.ДанныеПодключения(Объект.JIRA);
КонецФункции
